keytab = {
    "功能": [
        "日志设置",
        "重启",
        "数据处理",
        "训练拟合",
        "数据预测",
        "回测分析",
        "图形展示",
    ],
    "日志设置": {
        "日志名": "tmp.log",
    },
    "重启": {
        "功能名": "数据处理",
        "排序号": 1
    },
    "数据处理": {
        "输入数据": [],
        "处理方法": [],
        "输出数据": [],
        "输出性能": []
    },
    "训练拟合": {
        "输入数据": [],
        "训练模型": [],
        "输出模型": []
    },
    "数据预测": {
        "输入数据": [],
        "输入模型": [],
        "输出数据": []
    },
    "回测分析": {
        "输入数据": [],
    },
    "图形展示": {
        "输入数据": [],
        "绘图类型": "png",
        "输出图片": []
    },
}
