keytab = {
    "功能": [
        "日志设置",
        "重启",
        "数据处理",
        "训练拟合",
        "数据预测",
        "回测分析",
        "图形展示",
    ],
    "重启": {
        "功能名": "数据处理",
        "排序号": 1
    },
    "数据处理": {
        "输入数据": [],
        "处理方法": [],
        "输出前缀": "",
        "输出性能": []
    },
    "训练拟合": {
        "输入数据": [],
        "处理方法": [],
        "输出前缀": "",
        "输出性能": []
    },
    "数据预测": {
        "输入数据": [],
        "处理方法": [],
        "输出前缀": "",
        "输出性能": []
    },
    "回测分析": {
        "输入数据": [],
        "处理方法": [],
        "输出前缀": "",
        "输出性能": []
    },
    "图形展示": {
        "输入数据": [],
        "处理方法": [],
        "输出后缀": "png",
    },
}
