#
sector = [
    "stock",
    "fund"
]
keytab = {
    "功能": [
        "项目设置",
        "重启",
        "中止",
        "数据处理",
        "训练拆分",
        "序列特征",
        "数据运算",
        "数据合并",
        "数据复制",
        "数据提取",
        "训练拟合",
        "数据预测",
        "回测分析",
        "图形展示",
    ],
    "项目设置": {
        "位置": "",
        "结束提示": False,
    },
    "重启": {
        "功能名": "数据处理",
        "预清空": 0,
        "排序号": 1
    },
    "中止": {"": None},
    "数据处理": {
        "输入数据": [],
        "处理方法": [],
        "输出前缀": "",
    },
    "训练拆分": {
        "输入数据": [],
        "处理方法": [],
        "输出前缀": "",
    },
    "序列特征": {
        "输入数据": [],
        "输出前缀": "",
        "处理方法": ["均值n", "标准差n", "涨幅比n", "回撤n", "最涨n", "夏普n"],
        # 输出文件名 用方法的值 替换方法名的n，加 _
    },
    "数据合并": {
        "输入数据": [],
        "输出性能": []
    },
    "数据复制": {
        "输入数据": [],
        "输入前缀": ""
    },
    "数据运算": {
        "输入数据": [],
        "处理方法": ["+", "-", "*", "**", "/"],
        "输出前缀": "",
        "输出性能": []
    },
    "数据提取": {
        "输入数据": [],
        "处理方法": ["profit_all_annualized", "profit_trade_annualized", "胜率"],
        "输出前缀": "",
        "输出性能": []
    },
    "训练拟合": {
        "输入数据": [],
        "处理方法": [],
        "输出模型": "",
        "输出性能": []
    },
    "数据预测": {
        "输入数据": [],
        "输入模型": "",
        "标签文件": "",
        "处理方法": [],
        "输出前缀": "",
    },
    "回测分析": {
        "输入数据": [],
        "处理方法": [],
        "输出前缀": "",
        "输出性能": []
    },
    "图形展示": {
        "静默模式": 0,
        "处理方法": {"序列特征": [], "预测回测": [], "回测统计": []},
        "输出后缀": "png",
    },
}
